# Selection and subsetting : loc, iloc, iat, at, ix

In [1]:
import pandas as pd

In [2]:
students_score = {
    'Name' : ['Paul', 'Aaron', 'Krista', 'Veronica', 'Paxton', 'Madison', 'Aurora'],
    'Score': [98, 89, 99, 87, 90, 83, 82],
    'Grades': ['AA', 'AB', 'AA', 'AC', 'AB', 'BA', 'BB']
}

In [3]:
df_students = pd.DataFrame(students_score, index=['s1', 's2', 's3', 's4', 's5', 's6', 's7'])

df_students

        Name  Score Grades
s1      Paul     98     AA
s2     Aaron     89     AB
s3    Krista     99     AA
s4  Veronica     87     AC
s5    Paxton     90     AB
s6   Madison     83     BA
s7    Aurora     82     BB

## 1. loc

### 1.1. Name, Score, Grades of s1 and s2

In [4]:
df_students.loc[['s1', 's2'], :]

     Name  Score Grades
s1   Paul     98     AA
s2  Aaron     89     AB

### 1.2. Name and Grades of s1, s3, s5

In [5]:
df_students.loc[['s1', 's3', 's5'], ['Name', 'Grades']]

      Name Grades
s1    Paul     AA
s3  Krista     AA
s5  Paxton     AB

### 1.3. Name, Score, and Grades of s1 to s7

In [7]:
df_students.loc[:, :]

        Name  Score Grades
s1      Paul     98     AA
s2     Aaron     89     AB
s3    Krista     99     AA
s4  Veronica     87     AC
s5    Paxton     90     AB
s6   Madison     83     BA
s7    Aurora     82     BB

In [8]:
df_students.loc['s1': 's7', :]

        Name  Score Grades
s1      Paul     98     AA
s2     Aaron     89     AB
s3    Krista     99     AA
s4  Veronica     87     AC
s5    Paxton     90     AB
s6   Madison     83     BA
s7    Aurora     82     BB

## 2. iloc

### 2.1. Name, Score, and Grades of s1 and s2

In [10]:
df_students

        Name  Score Grades
s1      Paul     98     AA
s2     Aaron     89     AB
s3    Krista     99     AA
s4  Veronica     87     AC
s5    Paxton     90     AB
s6   Madison     83     BA
s7    Aurora     82     BB

In [12]:
df_students.iloc[0:2, :]

     Name  Score Grades
s1   Paul     98     AA
s2  Aaron     89     AB

In [13]:
df_students.iloc[[0, 1], :]

     Name  Score Grades
s1   Paul     98     AA
s2  Aaron     89     AB

### 2.2. Name and Grades of s1, s3, s5

In [14]:
df_students.iloc[[0, 2, 4], [0, 2]]

      Name Grades
s1    Paul     AA
s3  Krista     AA
s5  Paxton     AB

### 2.3. Name, Score, and Grades of s1 to s7

In [15]:
df_students.iloc[:, :]

        Name  Score Grades
s1      Paul     98     AA
s2     Aaron     89     AB
s3    Krista     99     AA
s4  Veronica     87     AC
s5    Paxton     90     AB
s6   Madison     83     BA
s7    Aurora     82     BB

In [16]:
df_students.iloc[0:7, :]

        Name  Score Grades
s1      Paul     98     AA
s2     Aaron     89     AB
s3    Krista     99     AA
s4  Veronica     87     AC
s5    Paxton     90     AB
s6   Madison     83     BA
s7    Aurora     82     BB

In [17]:
df_students.iloc[:7, :]

        Name  Score Grades
s1      Paul     98     AA
s2     Aaron     89     AB
s3    Krista     99     AA
s4  Veronica     87     AC
s5    Paxton     90     AB
s6   Madison     83     BA
s7    Aurora     82     BB

## 3. iat

`iat` is a method that enables access a single value for a row or column pair by integer position

similar to `iloc`, both uses integer as arguments

use `iat` if you only need to get or set a single value in a dataframe or series

### 3.1. Grade of s2

In [23]:
df_students

        Name  Score Grades
s1      Paul     98     AA
s2     Aaron     89     AB
s3    Krista     99     AA
s4  Veronica     87     AC
s5    Paxton     90     AB
s6   Madison     83     BA
s7    Aurora     82     BB

In [24]:
df_students.loc['s2', 'Grades']

'AB'

In [25]:
df_students.iat[1, 2]

'AB'

### 3.2. Name of s5

In [26]:
df_students.loc['s5', 'Name']

'Paxton'

In [27]:
df_students.iat[4, 0]

'Paxton'

### 3.3. Set score of s5 to 99

In [28]:
df_students.loc['s5', 'Score'] = 99

In [29]:
df_students

        Name  Score Grades
s1      Paul     98     AA
s2     Aaron     89     AB
s3    Krista     99     AA
s4  Veronica     87     AC
s5    Paxton     99     AB
s6   Madison     83     BA
s7    Aurora     82     BB

In [34]:
df_students.iat[4, 1] = 99

In [36]:
df_students.iat[4, 2] = 'AA'

In [37]:
df_students

        Name Score Grades
s1      Paul    98     AA
s2     Aaron    89     AB
s3    Krista    99     AA
s4  Veronica    87     AC
s5    Paxton    99     AA
s6   Madison    83     BA
s7    Aurora    82     BB

## 4. at

`at` accesses a single value for a row/column label pair

similar to loc, they both takes labels as arguments

Use `at` if you only need to get or set a single value in a dataframe or series

### 4.1. Grade of s2

In [39]:
df_students.loc['s2', 'Grades']

'AB'

In [41]:
df_students.at['s2', 'Grades']

'AB'

### 4.2. Name of s5

In [42]:
df_students.at['s5', 'Name']

'Paxton'

### 4.3. Set Score of s5 to 99

In [43]:
df_students.at['s5', 'Score'] = 99

In [44]:
df_students.at['s5', 'Grades'] = 'AA'

In [45]:
df_students

        Name Score Grades
s1      Paul    98     AA
s2     Aaron    89     AB
s3    Krista    99     AA
s4  Veronica    87     AC
s5    Paxton    99     AA
s6   Madison    83     BA
s7    Aurora    82     BB

In [46]:
df_students.loc['s5', ['Name', 'Score', 'Grades']]

Name      Paxton
Score         99
Grades        AA
Name: s5, dtype: object